Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N19.xml
      <value-group caption="" name="DACC_TRIGR__TRGEN1">
        <value caption="External trigger mode disabled. DAC is in free running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGSEL0">
        <value caption="TC0 output" name="TRGSEL0" value="0x0"/>
        <value caption="TC1 output" name="TRGSEL1" value="0x1"/>
        <value caption="TC2 output" name="TRGSEL2" value="0x2"/>
        <value caption="PWM0 event 0" name="TRGSEL3" value="0x3"/>
        <value caption="PWM0 event 1" name="TRGSEL4" value="0x4"/>
        <value caption="PWM1 event 0" name="TRGSEL5" value="0x5"/>
        <value caption="PWM1 event 1" name="TRGSEL6" value="0x6"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGSEL1">
        <value caption="TC0 output" name="TRGSEL0" value="0x0"/>
        <value caption="TC1 output" name="TRGSEL1" value="0x1"/>
        <value caption="TC2 output" name="TRGSEL2" value="0x2"/>
        <value caption="PWM0 event 0" name="TRGSEL3" value="0x3"/>
        <value caption="PWM0 event 1" name="TRGSEL4" value="0x4"/>
        <value caption="PWM1 event 0" name="TRGSEL5" value="0x5"/>
        <value caption="PWM1 event 1" name="TRGSEL6" value="0x6"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__OSR0">
        <value caption="OSR = 1" name="OSR_1" value="0x0"/>
        <value caption="OSR = 2" name="OSR_2" value="0x1"/>
        <value caption="OSR = 4" name="OSR_4" value="0x2"/>
        <value caption="OSR = 8" name="OSR_8" value="0x3"/>
        <value caption="OSR = 16" name="OSR_16" value="0x4"/>
        <value caption="OSR = 32" name="OSR_32" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__OSR1">
        <value caption="OSR = 1" name="OSR_1" value="0x0"/>
        <value caption="OSR = 2" name="OSR_2" value="0x1"/>
        <value caption="OSR = 4" name="OSR_4" value="0x2"/>
        <value caption="OSR = 8" name="OSR_8" value="0x3"/>
        <value caption="OSR = 16" name="OSR_16" value="0x4"/>
        <value caption="OSR = 32" name="OSR_32" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450V">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00010000" name="UECCELSB"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00020000" name="MECCELSB"/>
          <bitfield caption="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00040000" name="UECCEMSB"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00080000" name="MECCEMSB"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="EEFC Version Register" name="EEFC_VERSION" offset="0x14" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
        <register caption="Write Protection Mode Register" name="EEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EEFC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
