Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N19.xml
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 18)" name="GMAC_ST2CW118" offset="0x794" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW118__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 19)" name="GMAC_ST2CW019" offset="0x798" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 19)" name="GMAC_ST2CW119" offset="0x79C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW119__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 20)" name="GMAC_ST2CW020" offset="0x7A0" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 20)" name="GMAC_ST2CW120" offset="0x7A4" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW120__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 21)" name="GMAC_ST2CW021" offset="0x7A8" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 21)" name="GMAC_ST2CW121" offset="0x7AC" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW121__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 22)" name="GMAC_ST2CW022" offset="0x7B0" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 22)" name="GMAC_ST2CW122" offset="0x7B4" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW122__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 23)" name="GMAC_ST2CW023" offset="0x7B8" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 23)" name="GMAC_ST2CW123" offset="0x7BC" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW123__OFFSSTRT"/>
        </register>
      </register-group>
      <value-group caption="" name="GMAC_NCFGR__CLK">
        <value caption="MCK divided by 8 (MCK up to 20 MHz)" name="MCK_8" value="0x0"/>
        <value caption="MCK divided by 16 (MCK up to 40 MHz)" name="MCK_16" value="0x1"/>
        <value caption="MCK divided by 32 (MCK up to 80 MHz)" name="MCK_32" value="0x2"/>
        <value caption="MCK divided by 48 (MCK up to 120 MHz)" name="MCK_48" value="0x3"/>
        <value caption="MCK divided by 64 (MCK up to 160 MHz)" name="MCK_64" value="0x4"/>
        <value caption="MCK divided by 96 (MCK up to 240 MHz)" name="MCK_96" value="0x5"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__FBLDO">
        <value caption="00001: Always use SINGLE AHB bursts" name="SINGLE" value="0x1"/>
        <value caption="001xx: Attempt to use INCR4 AHB bursts (Default)" name="INCR4" value="0x4"/>
        <value caption="01xxx: Attempt to use INCR8 AHB bursts" name="INCR8" value="0x8"/>
        <value caption="1xxxx: Attempt to use INCR16 AHB bursts" name="INCR16" value="0x10"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__RXBMS">
        <value caption="4/8 Kbyte Memory Size" name="EIGHTH" value="0x0"/>
        <value caption="4/4 Kbytes Memory Size" name="QUARTER" value="0x1"/>
        <value caption="4/2 Kbytes Memory Size" name="HALF" value="0x2"/>
        <value caption="4 Kbytes Memory Size" name="FULL" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW10__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW11__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW12__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW13__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW14__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW15__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW16__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
