Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N19.xml
        <register caption="Fast Startup Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Startup Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Startup Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Startup Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Startup Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Startup Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Startup Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Startup Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Startup Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Startup Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Startup Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Startup Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Startup Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Startup Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Startup Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Startup Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="USB Alarm Enable" mask="0x00040000" name="USBAL"/>
          <bitfield caption="Low-power Mode" mask="0x00100000" name="LPM"/>
          <bitfield caption="Flash Low-power Mode" mask="0x00600000" name="FLPM" values="PMC_FSMR__FLPM"/>
          <bitfield caption="Force Flash Low-power Mode" mask="0x00800000" name="FFLPM"/>
        </register>
        <register caption="Fast Startup Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Polarity 0" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Fast Startup Input Polarity 1" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="Fast Startup Input Polarity 2" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="Fast Startup Input Polarity 3" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="Fast Startup Input Polarity 4" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="Fast Startup Input Polarity 5" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="Fast Startup Input Polarity 6" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="Fast Startup Input Polarity 7" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="Fast Startup Input Polarity 8" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="Fast Startup Input Polarity 9" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="Fast Startup Input Polarity 10" mask="0x00000400" name="FSTP10"/>
          <bitfield caption="Fast Startup Input Polarity 11" mask="0x00000800" name="FSTP11"/>
          <bitfield caption="Fast Startup Input Polarity 12" mask="0x00001000" name="FSTP12"/>
          <bitfield caption="Fast Startup Input Polarity 13" mask="0x00002000" name="FSTP13"/>
          <bitfield caption="Fast Startup Input Polarity 14" mask="0x00004000" name="FSTP14"/>
          <bitfield caption="Fast Startup Input Polarity 15" mask="0x00008000" name="FSTP15"/>
        </register>
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Write Protection Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Clock Enable Register 1" name="PMC_PCER1" offset="0x0100" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Enable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Enable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Enable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Enable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 37 Enable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 39 Enable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Enable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Enable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Enable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Enable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Enable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Enable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Enable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Enable" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Enable" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Enable" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Enable" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Enable" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 52 Enable" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral Clock 53 Enable" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral Clock 56 Enable" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Enable" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Enable" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Enable" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Enable" mask="0x10000000" name="PID60"/>
        </register>
